<h2><center>Week 5 - Assignment - Solutions</center></h2>
<h3><center>Programming for Data Science 2024</center></h3>

Exercises for the topics covered in the fifth lecture.

The exercise will be marked as passed if you get **at least 10/15** points.

Exercises must be handed in via **ILIAS** (Homework assignments). Deliver your submission as a compressed file (zip) containing one .py or .ipynb file with all exercises. The name of both the .zip and the .py/.ipynb file **must** be *SurnameName* of the two members of the group. Example: Riccardo Cusinato + Athina Tzovara = *CusinatoRiccardo_TzovaraAthina.zip* .

It's important to use comments to explain your code and show that you're able to take ownership of the exercises and discuss them.

You are not expected to collaborate outside of the group on exercises and submitting other groups’ code as your own will result in 0 points.

For questions contact: *riccardo.cusinato@unibe.ch* with the subject: *Programming for Data Science 2024*.

**Deadline: 14:00, March 28, 2024.**

<h3 style="text-align:left;">Exercise 1 - Fitbit dataset<span style="float: right">3 points</span></h3>

We will work with three datasets - 'activity.csv', 'calories.csv', and 'last_participant.csv', which contains activity tracker data from https://www.kaggle.com/datasets/arashnic/fitbit

If you are unable to do this exercise, you can load the dataset 'combined_solution.csv' for the next exercise.

1. **Data preparation** (*1 point*)

    - Load the two datasets 'activity.csv' and 'calories.csv'.
    - Use pd.to_datetime to standardize the ActivityDate columns (https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html)

In [1]:
import pandas as pd

activity_df = pd.read_csv('./data/activity.csv')
calories_df = pd.read_csv('./data/calories.csv')

activity_df['ActivityDate'] = pd.to_datetime(activity_df['ActivityDate'])
calories_df['ActivityDate'] = pd.to_datetime(calories_df['ActivityDate'])

C:\Users\manue\AppData\Local\Temp\ipykernel_9324\3047178429.py:6: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  activity_df['ActivityDate'] = pd.to_datetime(activity_df['ActivityDate'])
C:\Users\manue\AppData\Local\Temp\ipykernel_9324\3047178429.py:7: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  calories_df['ActivityDate'] = pd.to_datetime(calories_df['ActivityDate'])

2. **Merging** (*1 point*)

    - Consider what information is shared between the two datasets and merge them. Keep in mind that the order of rows is not the same in both datasets!
    - Print out the mean "TotalSteps" of the merged DataFrame at this point.

In [2]:
activity_df

,ID,ActivityDate,TotalSteps,TotalDistance,VeryActiveDistance,ModeratelyActiveDistance,LightActiveDistance,VeryActiveMinutes,FairlyActiveMinutes,LightlyActiveMinutes
0,1503960366,2016-04-12,13162.0,8.50,1.88,0.55,6.06,25,13,328
1,1503960366,2016-04-13,10735.0,6.97,1.57,0.69,4.71,21,19,217
2,1503960366,2016-04-14,10460.0,6.74,2.44,0.40,3.91,30,11,181
3,1503960366,2016-04-15,9762.0,6.28,2.14,1.26,2.83,29,34,209
4,1503960366,2016-04-16,12669.0,8.16,2.71,0.41,5.04,36,10,221
...,...,...,...,...,...,...,...,...,...,...
904,8792009665,2016-05-06,NaN,0.00,0.00,0.00,0.00,0,0,0
905,8792009665,2016-05-07,NaN,0.00,0.00,0.00,0.00,0,0,0
906,8792009665,2016-05-08,NaN,0.00,0.00,0.00,0.00,0,0,0
907,8792009665,2016-05-09,NaN,0.00,0.00,0.00,0.00,0,0,0
908,8792009665,2016-05-10,NaN,0.00,0.00,0.00,0.00,0,0,0

In [3]:
calories_df

             ID ActivityDate  Calories
0    1624580081   2016-04-12    1432.0
1    1624580081   2016-04-13    1411.0
2    1624580081   2016-04-14    1572.0
3    1624580081   2016-04-15    1344.0
4    1624580081   2016-04-16       NaN
..          ...          ...       ...
904  8792009665   2016-05-06    1688.0
905  8792009665   2016-05-07    1688.0
906  8792009665   2016-05-08    1688.0
907  8792009665   2016-05-09    1688.0
908  8792009665   2016-05-10       NaN

[909 rows x 3 columns]

In [3]:
merged_df = activity_df.merge(calories_df, on=['ID', 'ActivityDate'])
print(merged_df['TotalSteps'].mean())

7786.438763376932

3. **Concatenation** (*1 point*)

    - The data of one additional participant exists in 'last_participant.csv'. Load this dataset and concatenate it with the merged dataset generated above
    - Print out the mean "TotalSteps" again

In [11]:
last_participant_df = pd.read_csv('./data/last_participant.csv')
df = pd.concat([merged_df, last_participant_df], ignore_index=True)
print(df['TotalSteps'].mean())

7879.460599334073

<h3 style="text-align:left;">Exercise 2 - Working with missing data<span style="float: right">5 points</span></h3>

In our dataset, some values are missing from the 'TotalSteps' and 'Calories' columns.

We can try to approximate these missing values with the data we got. 

You can load the dataset 'combined_solution.csv' if you were unable to complete the previous exercise.

1. **Filling in missing values** (*3 points*)

    - Calculate the mean steps per calory burnt and mean calories burnt per step, by averaging across all observations in the dataset and then computing the ratio. Print out both values.
    - Fill in the null values in the columns 'Calories' and 'TotalSteps' where possible. To fill the values you have to use the factors *"TotalSteps/Calories"* and *"Calories/TotalSteps"* calculated in the previous point, using one of the two information to fill the other.
    - Print out the mean of the columns 'TotalSteps' and 'Calories' before and after filling the missing values.

In [4]:
df = pd.read_csv('./data/combined_solution.csv')

cal_per_step = df['Calories'].mean() / df['TotalSteps'].mean()
step_per_cal = df['TotalSteps'].mean() / df['Calories'].mean()

print(step_per_cal)
print(cal_per_step)

df_fillna = df.copy()
df_fillna['Calories'] = df['Calories'].fillna(df['TotalSteps'] * cal_per_step)
df_fillna['TotalSteps'] = df['TotalSteps'].fillna(df['Calories'] * step_per_cal)

print("Total steps before filling NaNs: ", df['TotalSteps'].mean(), " ; after: ", df_fillna['TotalSteps'].mean())
print("Calories before filling NaNs: ", df['Calories'].mean(), " ; after: ", df_fillna['Calories'].mean())

3.4100446727062272
0.29325129022617624
Total steps before filling NaNs:  7879.460599334073  ; after:  7785.911198419612
Calories before filling NaNs:  2310.661987041037  ; after:  2302.939349901768

2. **Dropping missing values** (*2 points*)

    - Print how many null values there are in the 'Calories' and 'TotalSteps' columns, respectively.
    - Drop the rows where **both** 'Calories' and 'TotalSteps' are missing.
    - Print number of rows in the final dataset.

In [19]:
print(df_fillna['Calories'].isna().sum())
print(df_fillna['TotalSteps'].isna().sum())

# Drop columns 
df_dropped = df_fillna[['Calories', 'TotalSteps']].dropna(how="all")
print(len(df))

13
13
969

<h3 style="text-align:left;">Exercise 3 - Multi-index<span style="float: right">7 points</span></h3>

In this exercise you will create and manipulate a multi-index dataframe. First, let's create the dataframe for the exercise:

In [21]:
import pandas as pd

df = pd.DataFrame(
    {
        "idx": [0, 1, 2],
        "A_X": [1.1, 1.1, 1.1],
        "A_Y": [1.2, 1.2, 1.2],
        "B_X": [1.11, 1.11, 1.11],
        "B_Y": [1.22, 1.22, 1.22],
    }
)

1. Set the column *idx* as the index of the dataframe. (*1 point*)

In [22]:
df = df.set_index("idx")
# or, df.set_index("idx", inplace=True)
df

     A_X  A_Y   B_X   B_Y
idx
0    1.1  1.2  1.11  1.22
1    1.1  1.2  1.11  1.22
2    1.1  1.2  1.11  1.22

2. Create a multi-column stucture. (*3 points*)
    - Set the columns *A, B* on the first level and *X, Y* on the second level, taken from the combinations in the original dataframe. 
    - Set the names of the two new levels as "L1" and "L2", respectively. 
    - Print the resulting dataframe.

In [26]:
# Create new columns from tuples by splitting the original names
new_cols = pd.MultiIndex.from_tuples([tuple(c.split("_")) for c in df.columns])

# Also possible:
# new_cols = pd.MultiIndex.from_product([["A", "B"], ["X", "Y"]])

# Assign new columns
df.columns = new_cols

# Set names of multi-index
df.columns.names = ["L1", "L2"]

print(df)

L1     A          B
L2     X    Y     X     Y
idx
0    1.1  1.2  1.11  1.22
1    1.1  1.2  1.11  1.22
2    1.1  1.2  1.11  1.22

3. From the previous dataframe, re-create a dataframe with a single column level. (*3 points*)
    - Create a new column from the first level (L1) of the multi-column. At this point your columns should be ['L1', 'X', 'Y'], with name 'L2'. **NB** The DataFrame method *reset_index* is useful for this part.
    - Rename the newly-created column as "letter" and the name of the column level as "L". Use the appropiate pandas methods for this.
    - Print the resulting dataframe.

In [30]:
# Stack the dataframe to have multi-index, reset to get L1 on columns
df_stacked = df.stack(level=0).reset_index(level=1)

# Rename 1st column and level name
df_stacked = df_stacked.rename(columns={"L1": "letter"})
df_stacked.columns.name = "L"

print(df_stacked)

L   letter     X     Y
idx
0        A  1.10  1.20
0        B  1.11  1.22
1        A  1.10  1.20
1        B  1.11  1.22
2        A  1.10  1.20
2        B  1.11  1.22

/var/folders/q0/xyqbb4c10p5c09n42wntpylc0000gn/T/ipykernel_73842/3426209637.py:2: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  df_stacked = df.stack(level=0).reset_index(level=1)

## Other topics

In [35]:
import numpy as np

### DataFrames with Multi-index

Hierarchical / Multi-level indexing enables you to store and manipulate data with an arbitrary number of dimensions in lower dimensional data structures like Series (1d) and DataFrame (2d).

In [32]:
arrays = [
    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
    ["one", "two", "one", "two", "one", "two", "one", "two"],
]
tuples = list(zip(*arrays))

tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [33]:
index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [36]:
s = pd.Series(np.random.randn(8), index=index)
s

first  second
bar    one      -0.829039
       two      -0.001808
baz    one      -0.096285
       two       0.547076
foo    one       0.519349
       two      -0.233025
qux    one       0.158289
       two       1.041788
dtype: float64

You can achieve the same result with the *from_product()* method:

In [ ]:
iterables = [["bar", "baz", "foo", "qux"], ["one", "two"]]
mulidx = pd.MultiIndex.from_product(iterables, names=["first", "second"])

s = pd.Series(np.random.randn(8), index=mulidx)
s

first  second
bar    one      -1.812449
       two       2.624417
baz    one       0.812177
       two       1.269380
foo    one      -1.009976
       two      -0.751334
qux    one       1.366920
       two      -0.268368
dtype: float64

You can then unstack and stack back the Series / DataFrame:

In [37]:
s.unstack()

second       one       two
first
bar    -0.829039 -0.001808
baz    -0.096285  0.547076
foo     0.519349 -0.233025
qux     0.158289  1.041788

In [38]:
s.equals(s.unstack().stack())

True

There's a function also to get the levels of each index:

In [39]:
s.index.get_level_values(0)

Index(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'], dtype='object', name='first')

In [ ]:
s.index.get_level_values(1)

Index(['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'], dtype='object', name='second')

You can access the multi-index as usual, or using tuples:

In [40]:
s["qux"]

second
one    0.158289
two    1.041788
dtype: float64

In [ ]:
s.loc[("qux", "one")]

1.366919621975131

In [41]:
s.loc[("baz", "two"):("qux", "one")]

first  second
baz    two       0.547076
foo    one       0.519349
       two      -0.233025
qux    one       0.158289
dtype: float64

Operations can also be performed on the different levels:

In [42]:
s.sub(s.loc["bar"], level=1)

first  second
bar    one       0.000000
       two       0.000000
baz    one       0.732754
       two       0.548885
foo    one       1.348388
       two      -0.231217
qux    one       0.987329
       two       1.043596
dtype: float64

A similar syntax for dataframes:

In [43]:
cols = pd.MultiIndex.from_tuples(
    [(x, y) for x in ["A", "B", "C"] for y in ["O", "I"]]
)
df = pd.DataFrame(np.random.randn(2, 6), index=["n", "m"], columns=cols)
df

          A                   B                   C
          O         I         O         I         O         I
n  0.964237 -1.313662  0.511888 -0.093083 -0.511101  1.130431
m  0.360818  1.140523  0.338357  1.208162  0.635012  0.050002

In [44]:
df.div(df["C"], level=1)

          A                    B               C
          O          I         O          I    O    I
n -1.886589  -1.162090 -1.001541  -0.082343  1.0  1.0
m  0.568206  22.809428  0.532835  24.162161  1.0  1.0

Series / Dataframes with MultiIndex can also be brought to a "melt" form:

In [45]:
s

first  second
bar    one      -0.829039
       two      -0.001808
baz    one      -0.096285
       two       0.547076
foo    one       0.519349
       two      -0.233025
qux    one       0.158289
       two       1.041788
dtype: float64

In [46]:
s.unstack()

second       one       two
first
bar    -0.829039 -0.001808
baz    -0.096285  0.547076
foo     0.519349 -0.233025
qux     0.158289  1.041788

In [47]:
s_unstack = s.unstack()
s_unstack.melt()

  second     value
0    one -0.829039
1    one -0.096285
2    one  0.519349
3    one  0.158289
4    two -0.001808
5    two  0.547076
6    two -0.233025
7    two  1.041788

We can also assign other column names:

In [48]:
s_unstack.melt(value_name="score")

  second     score
0    one -0.829039
1    one -0.096285
2    one  0.519349
3    one  0.158289
4    two -0.001808
5    two  0.547076
6    two -0.233025
7    two  1.041788

A similar syntax is for dataframes:

In [49]:
df

          A                   B                   C
          O         I         O         I         O         I
n  0.964237 -1.313662  0.511888 -0.093083 -0.511101  1.130431
m  0.360818  1.140523  0.338357  1.208162  0.635012  0.050002

In [ ]:
df.melt()

   variable_0 variable_1     value
0           A          O -0.288376
1           A          O -0.304325
2           A          I  0.140412
3           A          I  1.157317
4           B          O  0.311072
5           B          O  1.554954
6           B          I -1.349600
7           B          I  0.528105
8           C          O -1.140482
9           C          O -0.666256
10          C          I  0.475237
11          C          I -0.687407

And we can also choose the level on which to melt:

In [50]:
df.melt(col_level=1)

   variable     value
0         O  0.964237
1         O  0.360818
2         I -1.313662
3         I  1.140523
4         O  0.511888
5         O  0.338357
6         I -0.093083
7         I  1.208162
8         O -0.511101
9         O  0.635012
10        I  1.130431
11        I  0.050002

### Groupby

Melting is very useful if we then want to groupby and compute aggregate values. For example:

In [52]:
df_melt = df.melt(col_level=1)

df_melt.groupby("variable").mean()

             value
variable
I         0.353729
O         0.383202

In [ ]:
df_melt = df.melt()

df_melt.groupby(["variable_0", "variable_1"]).mean()

                          value
variable_0 variable_1
A          I           0.648865
           O          -0.296351
B          I          -0.410747
           O           0.933013
C          I          -0.106085
           O          -0.903369

In [53]:
data = {'Category': ['A', 'B', 'A', 'B', 'A', 'B'],
        'Value': [10, 20, 30, 40, 50, 60]}
df = pd.DataFrame(data)

df

  Category  Value
0        A     10
1        B     20
2        A     30
3        B     40
4        A     50
5        B     60

How to compute the sum of 'Value' for each category where the 'Value' is greater than 30?

In [54]:
# Solution

grouped_sum_gt_30 = df[df['Value'] > 30].groupby('Category')['Value'].sum()
print(grouped_sum_gt_30)

Category
A     50
B    100
Name: Value, dtype: int64

### Pivot tables

Used to aggregate data across multiple index / columns

In [56]:
data = {'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
        'B': ['one', 'one', 'two', 'two', 'one', 'one'],
        'C': [1, 2, 3, 4, 5, 6]}
df = pd.DataFrame(data)

df

     A    B  C
0  foo  one  1
1  foo  one  2
2  foo  two  3
3  bar  two  4
4  bar  one  5
5  bar  one  6

In [57]:
pivot_median = df.pivot_table(values='C', index='A', columns='B', aggfunc='median')
print(pivot_median)

B    one  two
A
bar  5.5  4.0
foo  1.5  3.0

Can use different aggregate functions:

In [9]:
pivot_sum = df.pivot_table(values='C', index='A', columns='B', aggfunc='sum')
print(pivot_sum)

B    one  two
A
bar   11    4
foo    3    3

And have values per row:

In [10]:
df.pivot_table(values='C', index='A', columns='B', aggfunc='median', margins=True)

B    one  two  All
A
bar  5.5  4.0  5.0
foo  1.5  3.0  2.0
All  3.5  3.5  3.5

### Joining dataframes

In class you have seen that "merging" two dataframes with different index/columns will result in the union of them.

In [ ]:
df1 = pd.DataFrame(np.random.randint(0, 20, (2, 2)),
                 columns=list('AB'))
df2 = pd.DataFrame(np.random.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
print(df1)
print(df2)

    A   B
0   1  15
1  17   3
   B  A  C
0  2  6  7
1  7  6  7
2  4  4  7

In [ ]:
df1 / df2

          A         B   C
0  0.166667  7.500000 NaN
1  2.833333  0.428571 NaN
2       NaN       NaN NaN

This result follows from the fact that df1 lacks index "2" and column "C".

As with arrays, we can use *pd.concat* to concatenate two dataframes along the 1st axis (rows):

In [ ]:
# ignore_index=True creates a dataframe with a consecutive index
pd.concat([df1, df2], ignore_index=True)

    A   B    C
0   1  15  NaN
1  17   3  NaN
2   6   2  7.0
3   6   7  7.0
4   4   4  7.0

Notice how the column C has now type float because of the missing values!

The same operation with arrays throws an error because of the missing values:

In [ ]:
np.concatenate([df1.to_numpy(), df2.to_numpy()])

ValueError: all the input array dimensions except for the concatenation axis must match exactly, but along dimension 1, the array at index 0 has size 2 and the array at index 1 has size 3

The default be havior of *pd.concat* is to join the dataframe with the "outer" method, i.e. by keeping the union of the index / columns. The behavior is different when you specify the *join* parameter:

https://pandas.pydata.org/docs/user_guide/merging.html

In [ ]:
pd.concat([df1, df2], join="inner", ignore_index=True)

    A   B
0   1  15
1  17   3
2   6   2
3   6   7
4   4   4

In this case, you see that just the columns in common are kept.

Rather than concatenating information, we can also combine them from different dataframes (i.e. concatenating on columns). We can use merge in this case:
- one-to-one: joining two DataFrame objects on their indexes which must contain unique values.
- many-to-one: joining a unique index to one or more columns in a different DataFrame.
- many-to-many : joining columns on columns.

In [ ]:
left = pd.DataFrame({"key": ["A", "B"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["A", "B"], "rval": [4, 5]})

print(left)
print(right)

pd.merge(left, right)

  key  lval
0   A     1
1   B     2
  key  rval
0   A     4
1   B     5

  key  lval  rval
0   A     1     4
1   B     2     5

In [ ]:
# This is equivalent to the previous
pd.merge(left, right, on="key")

  key  lval  rval
0   A     1     4
1   B     2     5

In [ ]:
left = pd.DataFrame(
   {
      "key1": ["K0", "K0", "K1", "K2"],
      "key2": ["K0", "K1", "K0", "K1"],
      "A": ["A0", "A1", "A2", "A3"],
      "B": ["B0", "B1", "B2", "B3"],
   }
)

right = pd.DataFrame(
   {
      "key1": ["K0", "K1", "K1", "K2"],
      "key2": ["K0", "K0", "K0", "K0"],
      "C": ["C0", "C1", "C2", "C3"],
      "D": ["D0", "D1", "D2", "D3"],
   }
)

print(left)
print(right)

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3
  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

"Inner" (intersection):

In [ ]:
pd.merge(left, right, how="inner", on=["key1", "key2"])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

"Outer" (union):

In [ ]:
pd.merge(left, right, how="outer", on=["key1", "key2"])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K2   K1   A3   B3  NaN  NaN